Soap/account/samples/account_minimalistic.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <AMLYZE_ACCOUNT xmlns="urn:amlyze-services:ImportAccountService_v1r0">
            <CommunicationNumber>ComNr_000321</CommunicationNumber>
            <Requester>financial_institution</Requester>
            <ListAccount>
                <Account>
                    <BusinessEntityExtId>IND20231113T180927</BusinessEntityExtId>
                    <AccountExtId>Acc_0011</AccountExtId>
                    <AccountNumber>LI9208800274335945522</AccountNumber>
                    <AccountStatus>ACTIVE</AccountStatus>
                    <BIC>BICXX22</BIC>
                    <CurrencyCode>EUR</CurrencyCode>
                    <OpeningDate>2023-09-16T12:10:11+02:00</OpeningDate>
                    <isOtherFinInstAccount>false</isOtherFinInstAccount>
                </Account>
            </ListAccount>
        </AMLYZE_ACCOUNT>
    </soap:Body>
</soap:Envelope>
